sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/controller/stm32wb05n_gap_aci.c
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0ab;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_set_advertising_enable(uint8_t Enable,
                                          uint8_t Number_of_Sets,
                                          Advertising_Set_Parameters_t Advertising_Set_Parameters[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_set_advertising_enable_cp0 *cp0 = (aci_gap_set_advertising_enable_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Enable = htob(Enable, 1);
  index_input += 1;
  cp0->Number_of_Sets = htob(Number_of_Sets, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (int i = 0; i < Number_of_Sets; i++) {
      packed_Advertising_Set_Parameters_t *Advertising_Set_Parameters_tmp = (packed_Advertising_Set_Parameters_t *)(((uint8_t *)cmd_buffer) + index_input);
      Advertising_Set_Parameters_tmp->Advertising_Handle = Advertising_Set_Parameters[i].Advertising_Handle;
      index_input += 1;
      Advertising_Set_Parameters_tmp->Duration = Advertising_Set_Parameters[i].Duration;
      index_input += 2;
      Advertising_Set_Parameters_tmp->Max_Extended_Advertising_Events = Advertising_Set_Parameters[i].Max_Extended_Advertising_Events;
      index_input += 1;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0ac;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_set_advertising_data_nwk(uint8_t Advertising_Handle,
                                            uint8_t Operation,
                                            uint8_t Advertising_Data_Length,
                                            uint8_t Advertising_Data[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_set_advertising_data_nwk_cp0 *cp0 = (aci_gap_set_advertising_data_nwk_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Operation = htob(Operation, 1);
  index_input += 1;
  cp0->Advertising_Data_Length = htob(Advertising_Data_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Advertising_Data, (const void *) Advertising_Data, Advertising_Data_Length*sizeof(uint8_t));
    index_input += Advertising_Data_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0ad;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_set_scan_response_data_nwk(uint8_t Advertising_Handle,
                                              uint8_t Operation,
                                              uint8_t Scan_Response_Data_Length,
                                              uint8_t Scan_Response_Data[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_set_scan_response_data_nwk_cp0 *cp0 = (aci_gap_set_scan_response_data_nwk_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Operation = htob(Operation, 1);
  index_input += 1;
  cp0->Scan_Response_Data_Length = htob(Scan_Response_Data_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Scan_Response_Data, (const void *) Scan_Response_Data, Scan_Response_Data_Length*sizeof(uint8_t));
    index_input += Scan_Response_Data_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0ae;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_set_scan_configuration(uint8_t Filter_Duplicates,
                                          uint8_t Scanning_Filter_Policy,
                                          uint8_t Scanning_PHY,
                                          uint8_t Scan_Type,
                                          uint16_t Scan_Interval,
                                          uint16_t Scan_Window)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_set_scan_configuration_cp0 *cp0 = (aci_gap_set_scan_configuration_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Filter_Duplicates = htob(Filter_Duplicates, 1);
  index_input += 1;
  cp0->Scanning_Filter_Policy = htob(Scanning_Filter_Policy, 1);
  index_input += 1;
  cp0->Scanning_PHY = htob(Scanning_PHY, 1);
  index_input += 1;
  cp0->Scan_Type = htob(Scan_Type, 1);
  index_input += 1;
  cp0->Scan_Interval = htob(Scan_Interval, 2);
  index_input += 2;
  cp0->Scan_Window = htob(Scan_Window, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0af;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_set_connection_configuration(uint8_t Initiating_PHY,
                                                uint16_t Connection_Interval_Min,
                                                uint16_t Connection_Interval_Max,
                                                uint16_t Max_Latency,
                                                uint16_t Supervision_Timeout,
                                                uint16_t Min_CE_Length,
                                                uint16_t Max_CE_Length)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_set_connection_configuration_cp0 *cp0 = (aci_gap_set_connection_configuration_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Initiating_PHY = htob(Initiating_PHY, 1);
  index_input += 1;
  cp0->Connection_Interval_Min = htob(Connection_Interval_Min, 2);
  index_input += 2;
  cp0->Connection_Interval_Max = htob(Connection_Interval_Max, 2);
  index_input += 2;
  cp0->Max_Latency = htob(Max_Latency, 2);
  index_input += 2;
  cp0->Supervision_Timeout = htob(Supervision_Timeout, 2);
  index_input += 2;
  cp0->Min_CE_Length = htob(Min_CE_Length, 2);
  index_input += 2;
  cp0->Max_CE_Length = htob(Max_CE_Length, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0b0;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_start_procedure(uint8_t Procedure_Code,
                                   uint8_t PHYs,
                                   uint16_t Duration,
                                   uint16_t Period)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_start_procedure_cp0 *cp0 = (aci_gap_start_procedure_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Procedure_Code = htob(Procedure_Code, 1);
  index_input += 1;
  cp0->PHYs = htob(PHYs, 1);
  index_input += 1;
  cp0->Duration = htob(Duration, 2);
  index_input += 2;
  cp0->Period = htob(Period, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0b1;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_discover_name(uint8_t PHYs,
                                 uint8_t Peer_Address_Type,
                                 uint8_t Peer_Address[6])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_discover_name_cp0 *cp0 = (aci_gap_discover_name_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->PHYs = htob(PHYs, 1);
  index_input += 1;
  cp0->Peer_Address_Type = htob(Peer_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Peer_Address, (const void *) Peer_Address, 6);
  index_input += 6;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0b2;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_add_devices_to_filter_accept_and_resolving_list(uint8_t Lists,
                                                                   uint8_t Clear_Lists,
                                                                   uint8_t Num_of_List_Entries,
                                                                   List_Entry_t List_Entry[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_add_devices_to_filter_accept_and_resolving_list_cp0 *cp0 = (aci_gap_add_devices_to_filter_accept_and_resolving_list_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Lists = htob(Lists, 1);
  index_input += 1;
  cp0->Clear_Lists = htob(Clear_Lists, 1);
  index_input += 1;
  cp0->Num_of_List_Entries = htob(Num_of_List_Entries, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (int i = 0; i < Num_of_List_Entries; i++) {
      packed_List_Entry_t *List_Entry_tmp = (packed_List_Entry_t *)(((uint8_t *)cmd_buffer) + index_input);
      List_Entry_tmp->Peer_Address_Type = List_Entry[i].Peer_Address_Type;
      index_input += 1;
      STM32WB_memcpy(List_Entry_tmp->Peer_Address, List_Entry[i].Peer_Address, 6);
      index_input += 6;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0b3;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_configure_filter_accept_and_resolving_list(uint8_t Lists)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_configure_filter_accept_and_resolving_list_cp0 *cp0 = (aci_gap_configure_filter_accept_and_resolving_list_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Lists = htob(Lists, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0b4;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_remove_advertising_set(uint8_t Advertising_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_remove_advertising_set_cp0 *cp0 = (aci_gap_remove_advertising_set_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0ba;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_clear_advertising_sets(void)
{
  struct hci_request rq;
  tBleStatus status = 0;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0bb;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_create_periodic_advertising_connection(uint8_t Advertising_Handle,
                                                          uint8_t Subevent,
                                                          uint8_t Initiator_Filter_Policy,
                                                          uint8_t Own_Address_Type,
                                                          uint8_t Peer_Address_Type,
                                                          uint8_t Peer_Address[6],
                                                          uint16_t Connection_Interval_Min,
                                                          uint16_t Connection_Interval_Max,
                                                          uint16_t Max_Latency,
                                                          uint16_t Supervision_Timeout,
                                                          uint16_t Min_CE_Length,
                                                          uint16_t Max_CE_Length)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_create_periodic_advertising_connection_cp0 *cp0 = (aci_gap_create_periodic_advertising_connection_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Subevent = htob(Subevent, 1);
  index_input += 1;
  cp0->Initiator_Filter_Policy = htob(Initiator_Filter_Policy, 1);
  index_input += 1;
  cp0->Own_Address_Type = htob(Own_Address_Type, 1);
  index_input += 1;
  cp0->Peer_Address_Type = htob(Peer_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Peer_Address, (const void *) Peer_Address, 6);
  index_input += 6;
  cp0->Connection_Interval_Min = htob(Connection_Interval_Min, 2);
  index_input += 2;
  cp0->Connection_Interval_Max = htob(Connection_Interval_Max, 2);
  index_input += 2;
  cp0->Max_Latency = htob(Max_Latency, 2);
  index_input += 2;
  cp0->Supervision_Timeout = htob(Supervision_Timeout, 2);
  index_input += 2;
  cp0->Min_CE_Length = htob(Min_CE_Length, 2);
  index_input += 2;
  cp0->Max_CE_Length = htob(Max_CE_Length, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0ca;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_encrypt_adv_data_nwk(uint8_t Session_Key[16],
                                        uint8_t IV[8],
                                        uint8_t Data_Length,
                                        uint8_t Data[],
                                        uint8_t *Encrypted_Data_Length,
                                        uint8_t Encrypted_Data[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_encrypt_adv_data_nwk_cp0 *cp0 = (aci_gap_encrypt_adv_data_nwk_cp0*)(cmd_buffer);
  aci_gap_encrypt_adv_data_nwk_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  STM32WB_memcpy((void *) &cp0->Session_Key, (const void *) Session_Key, 16);
  index_input += 16;
  STM32WB_memcpy((void *) &cp0->IV, (const void *) IV, 8);
  index_input += 8;
  cp0->Data_Length = htob(Data_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Data, (const void *) Data, Data_Length*sizeof(uint8_t));
    index_input += Data_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0cb;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Encrypted_Data_Length = btoh(resp.Encrypted_Data_Length, 1);
  STM32WB_memcpy((void *) Encrypted_Data, (const void *) resp.Encrypted_Data, *Encrypted_Data_Length*sizeof(uint8_t));
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gap_decrypt_adv_data_nwk(uint8_t Session_Key[16],
                                        uint8_t IV[8],
                                        uint8_t Encrypted_Data_Length,
                                        uint8_t Encrypted_Data[],
                                        uint8_t *Decrypted_Data_Length,
                                        uint8_t Decrypted_Data[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gap_decrypt_adv_data_nwk_cp0 *cp0 = (aci_gap_decrypt_adv_data_nwk_cp0*)(cmd_buffer);
  aci_gap_decrypt_adv_data_nwk_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  STM32WB_memcpy((void *) &cp0->Session_Key, (const void *) Session_Key, 16);
  index_input += 16;
  STM32WB_memcpy((void *) &cp0->IV, (const void *) IV, 8);
  index_input += 8;
  cp0->Encrypted_Data_Length = htob(Encrypted_Data_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Encrypted_Data, (const void *) Encrypted_Data, Encrypted_Data_Length*sizeof(uint8_t));
    index_input += Encrypted_Data_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x0cc;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Decrypted_Data_Length = btoh(resp.Decrypted_Data_Length, 1);
  STM32WB_memcpy((void *) Decrypted_Data, (const void *) resp.Decrypted_Data, *Decrypted_Data_Length*sizeof(uint8_t));
  return BLE_STATUS_SUCCESS;
}
